package com.cmlteam.derj_arh_bud;

import java.util.Objects;

public enum DabCategory {
    CAT_01("01", "повідомлення про початок підготовчих робіт"),
    CAT_02("02", "зміна даних у повідомленні про початок підготовчих робіт"),
    CAT_03("03", "декларація про початок підготовчих робіт"),
    CAT_04("04", "повернення на доопрацювання декларації про початок підготовчих робіт"),
    CAT_05("05", "зміна даних у декларації про початок підготовчих робіт"),
    CAT_06("06", "повідомлення про початок будівельних робіт"),
    CAT_07("07", "зміна даних у повідомленні про початок будівельних робіт"),
    CAT_08("08", "декларація про початок будівельних робіт"),
    CAT_09("09", "повернення на доопрацювання декларації про початок будівельних робіт"),
    CAT_10("10", "зміна даних у декларації про початок будівельних робіт"),
    CAT_11("11", "дозвіл на будівельні роботи"),
    CAT_12("12", "повідомлення про зміну даних в дозволі на будівельні роботи"),
    CAT_13("13", "відмова у наданні дозволу"),
    CAT_14("14", "декларація про готовність об’єкта до експлуатації"),
    CAT_15("15", "відмова у реєстрації декларації про готовність об’єкта до експлуатації"),
    CAT_16("16", "сертифікат"),
    CAT_17("17", "відмова у видачі сертифікату"),
    CAT_18("18", "декларація про готовність об`єкта (індивідуальних)"),
    CAT_19("19", "декларація про готовність об`єкта (господарських)"),
    CAT_20("20", "декларація про готовність об`єкта (громадських)"),
    CAT_21("21", "повернення декларації про готовність об’єкта"),;

    private String catNo;
    private String catDescr;

    DabCategory(String catNo, String catDescr) {
        this.catNo = catNo;
        this.catDescr = catDescr;
    }

    public  static DabCategory of(String catNo) {
        for (DabCategory category : values()) {
            if (Objects.equals(catNo, category.catNo))
                return category;
        }
        return null;
    }
}
